# Import pandas

In [4]:
import pandas as pd
import numpy as np
pd.__version__

'2.2.2'

In [5]:
s = pd.Series([10,20,30])
s

0    10
1    20
2    30
dtype: int64

In [29]:
df = pd.DataFrame({
    "name":["suji","shu"],
    "age":[21,20]
})
df

   name  age
0  suji   21
1   shu   20

# Writing the data into files

In [30]:
df.to_csv('data.csv',index=False)

In [31]:
df.to_excel('new.xlsx',sheet_name = 'weather_data')

# Reading the data(csv)

In [32]:
df=pd.read_csv('data.csv')
df

   name  age
0  suji   21
1   shu   20

# Exploring Data

In [33]:
df.head(3)

   name  age
0  suji   21
1   shu   20

In [34]:
df.tail()

   name  age
0  suji   21
1   shu   20

In [35]:
df.shape

(2, 2)

In [36]:
df[2:5]

Empty DataFrame
Columns: [name, age]
Index: []

In [37]:
df.columns

Index(['name', 'age'], dtype='object')

In [38]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [39]:
df.dtypes

name    object
age      int64
dtype: object

# Missing values

In [40]:
df.isnull()

    name    age
0  False  False
1  False  False

In [45]:
df = pd.DataFrame({
    "name":["suji","shu","prasi"],
    "age":[20,21,None]
     })
df

    name   age
0   suji  20.0
1    shu  21.0
2  prasi   NaN

In [46]:
df.isnull().sum()   # total Missing values

name    0
age     1
dtype: int64

In [47]:
df[df.isnull().any(axis=1)]   #show rows with missing values

    name  age
2  prasi  NaN

In [48]:
df['age'] = df['age'].fillna(df['age'].mean())

In [49]:
df

    name   age
0   suji  20.0
1    shu  21.0
2  prasi  20.5

In [50]:
df_clean = df.dropna()

In [51]:
df_clean

    name   age
0   suji  20.0
1    shu  21.0
2  prasi  20.5

# Duplicates

In [53]:
df = pd.DataFrame({
    "name":["suji","shu","prasi"],
    "age":[20,21,20]
})
df

    name  age
0   suji   20
1    shu   21
2  prasi   20

In [54]:
df.duplicated()

0    False
1    False
2    False
dtype: bool

In [55]:
df = df.drop_duplicates()
df

    name  age
0   suji   20
1    shu   21
2  prasi   20